## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_manifest.cinema-gateway will be updated in-place
!   resource "kubernetes_manifest" "cinema-gateway" {
!       object   = {
!           spec       = {
!               servers  = [
                    {
                        bind            = null
                        defaultEndpoint = null
                        hosts           = [
                            "wayofthesys.org",
                        ]
                        name            = null
                        port            = {
                            name       = "http"
                            number     = 80
                            protocol   = "HTTP"
                            targetPort = null
                        }
                        tls             = {
                            caCertificates        = null
                            cipherSuites          = null
                            credentialName        = null
                            httpsRedirect         = false
                            maxProtocolVersion    = null
                            minProtocolVersion    = null
                            mode                  = null
                            privateKey            = null
                            serverCertificate     = null
                            subjectAltNames       = null
                            verifyCertificateHash = null
                            verifyCertificateSpki = null
                        }
                    },
!                   {
                        name            = null
!                       tls             = {
!                           credentialName        = "cinema-cert" -> "wayofthesys-org-tls"
                            # (11 unchanged elements hidden)
                        }
                        # (4 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # kubernetes_secret.wayofthesys-tls must be replaced
-/+ resource "kubernetes_secret" "wayofthesys-tls" {
!       id        = "istio-system/wayofthesys-org-tls" -> (known after apply)
-       immutable = false -> null
        # (2 unchanged attributes hidden)

!       metadata {
-           annotations      = {} -> null
!           generation       = 0 -> (known after apply)
-           labels           = {} -> null
            name             = "wayofthesys-org-tls"
!           namespace        = "istio-system" -> "cinema" # forces replacement
!           resource_version = "3137890" -> (known after apply)
!           uid              = "315e3038-45f8-41b6-92f0-33bd640c3be8" -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
